/*Да се състави програма, която извежда квадрат, чийто страни са
оформени със знака *, а вътрешността е запълнена със въведен
знак.
Входни данни b - дължина на страната число от интервала
[3..20], c - желан знак.
Програмата да използва цикъл for. */

let b = Math.ceil(Math.random() * (20 - 3 + 1) + 3); 
let c = "*";



for (row = 1; row <= b; row++) {
    let form = "";
    
    for (col = 1; col <= b ; col++) {
        if (row == 1 || row == b || col == 1 || col == b) {
            form += c;
        } else {
            form += b;
        }
    };
    console.log(form);
};






