/*По зададено число n, да се изведе на екрана таблица по
следния начин: */

// Някъв рандъм нъмбър.
let num = Math.ceil(Math.random() * 5);

//цикъл със стъпки равен на num.
for (i = 0; i <=num - 1; i++) {
    //създаваме две променливи в при първа стъпка m = 5 - 1 + 0 тоест 4 
    // втора стъпка е 5 - 1 + i * 2 - тоест на втора стъпка имаме 6, после 8 и тн.
    let m = num - 1 + i * 2;
    //втората променлива е за превръщане в стринг, ползва се във вложения цикъл
    let mStr = "";
    //вложения цикъл просто превръща всички итерации на m в string.
    for (j = 0; j <= num -1; j++) {
        mStr += m;
    }

    console.log(mStr);
    
};







